In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])
#nan = not a number
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
#date_range = pandas의 날짜형데이터 - 기본날짜, periods 일간 날짜 출력
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
#DataFrame유형의 데이터 - 6행4열의 random변수, index는 위에서 만든 날짜형 데이터 date
df

                   A         B         C         D
2013-01-01 -1.346028 -0.172023 -0.732875 -0.235693
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623
2013-01-04 -0.577663  0.351967 -1.176386  1.117736
2013-01-05  0.449258  1.143338  0.136259 -2.299318
2013-01-06  0.724207  0.292115 -1.126457 -0.938840

In [5]:
df.head(3)

                   A         B         C         D
2013-01-01 -1.346028 -0.172023 -0.732875 -0.235693
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623

In [6]:
df.index #세로줄

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns #가로줄

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.values #내용, 값

array([[-1.3460277 , -0.17202263, -0.73287521, -0.23569259],
       [ 0.45190487, -0.50507605, -1.14116268,  1.03708117],
       [-0.56589325, -1.89114126, -1.24540593, -0.35262265],
       [-0.57766291,  0.35196736, -1.17638578,  1.11773575],
       [ 0.44925832,  1.14333808,  0.136259  , -2.29931794],
       [ 0.72420663,  0.29211457, -1.12645671, -0.93883978]])

In [9]:
df.info() #DataFrame의 개요

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.144036 -0.130137 -0.881005 -0.278609
std    0.808921  1.027222  0.530044  1.281195
min   -1.346028 -1.891141 -1.245406 -2.299318
25%   -0.574720 -0.421813 -1.167580 -0.792285
50%   -0.058317  0.060046 -1.133810 -0.294158
75%    0.451243  0.337004 -0.831271  0.718888
max    0.724207  1.143338  0.136259  1.117736

In [11]:
df.sort_values(by='B', ascending=False)
#sort_values = by로 지정된 칼럼 기준으로 asceding=False이면 내림차순(작아지게)  *df 자체의 순서가 바뀌는건 아니고 임시적 배열

                   A         B         C         D
2013-01-05  0.449258  1.143338  0.136259 -2.299318
2013-01-04 -0.577663  0.351967 -1.176386  1.117736
2013-01-06  0.724207  0.292115 -1.126457 -0.938840
2013-01-01 -1.346028 -0.172023 -0.732875 -0.235693
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623

In [12]:
df

                   A         B         C         D
2013-01-01 -1.346028 -0.172023 -0.732875 -0.235693
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623
2013-01-04 -0.577663  0.351967 -1.176386  1.117736
2013-01-05  0.449258  1.143338  0.136259 -2.299318
2013-01-06  0.724207  0.292115 -1.126457 -0.938840

In [13]:
df['A'] #보고싶은 변수명 부분만 줄여서 보기

2013-01-01   -1.346028
2013-01-02    0.451905
2013-01-03   -0.565893
2013-01-04   -0.577663
2013-01-05    0.449258
2013-01-06    0.724207
Freq: D, Name: A, dtype: float64

In [14]:
df[1:4] #보고싶은 행(가로줄) 범위 지정. 기본적으로 제목부분은 나옴.

                   A         B         C         D
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623
2013-01-04 -0.577663  0.351967 -1.176386  1.117736

In [15]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623
2013-01-04 -0.577663  0.351967 -1.176386  1.117736

In [16]:
df.loc[dates[0]] #loc : location 옵션으로 위치값 정해서 슬라이싱

A   -1.346028
B   -0.172023
C   -0.732875
D   -0.235693
Name: 2013-01-01 00:00:00, dtype: float64

In [17]:
df.loc[:,['A','B']]  # A,B 열의 모든 행 보여줌

                   A         B
2013-01-01 -1.346028 -0.172023
2013-01-02  0.451905 -0.505076
2013-01-03 -0.565893 -1.891141
2013-01-04 -0.577663  0.351967
2013-01-05  0.449258  1.143338
2013-01-06  0.724207  0.292115

In [18]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.451905 -0.505076
2013-01-03 -0.565893 -1.891141
2013-01-04 -0.577663  0.351967

In [19]:
df.loc['20130102',['A','B']]

A    0.451905
B   -0.505076
Name: 2013-01-02 00:00:00, dtype: float64

In [20]:
df.loc[dates[0],'A']

-1.3460277020555858

In [21]:
df.iloc[3]  # iloc : 행,열 번호 이용해 데이터에 바로 접근. :은 전체 의미. 현재 4번째행 의미

A   -0.577663
B    0.351967
C   -1.176386
D    1.117736
Name: 2013-01-04 00:00:00, dtype: float64

In [22]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.577663  0.351967
2013-01-05  0.449258  1.143338

In [23]:
df.iloc[[1,2,4],0:2]

                   A         B
2013-01-02  0.451905 -0.505076
2013-01-03 -0.565893 -1.891141
2013-01-05  0.449258  1.143338

In [24]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623

In [25]:
df[df.A>0]
#df.A : 컬럼A에서 0보다 큰 행만 얻기. 조건만족하지 않은 곳은 NaN처리 됨

                   A         B         C         D
2013-01-02  0.451905 -0.505076 -1.141163  1.037081
2013-01-05  0.449258  1.143338  0.136259 -2.299318
2013-01-06  0.724207  0.292115 -1.126457 -0.938840

In [26]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.451905       NaN       NaN  1.037081
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN  0.351967       NaN  1.117736
2013-01-05  0.449258  1.143338  0.136259       NaN
2013-01-06  0.724207  0.292115       NaN       NaN

In [31]:
df2=df.copy()  #데이터 위치만 복사되어 원본 데이터는 하나만 있음

In [32]:
df2['E']=['one', 'one', 'two', 'three', 'four', 'three']

In [33]:
df2

                   A         B         C         D      E
2013-01-01 -1.346028 -0.172023 -0.732875 -0.235693    one
2013-01-02  0.451905 -0.505076 -1.141163  1.037081    one
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623    two
2013-01-04 -0.577663  0.351967 -1.176386  1.117736  three
2013-01-05  0.449258  1.143338  0.136259 -2.299318   four
2013-01-06  0.724207  0.292115 -1.126457 -0.938840  three

In [34]:
df2['E'].isin(['two', 'four']) #isin : 컬럼에서 조건을 걸기

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [35]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.565893 -1.891141 -1.245406 -0.352623   two
2013-01-05  0.449258  1.143338  0.136259 -2.299318  four

In [36]:
df.apply(np.cumsum) # apply: 특정함수 적용 / consum : 누적합

                   A         B         C         D
2013-01-01 -1.346028 -0.172023 -0.732875 -0.235693
2013-01-02 -0.894123 -0.677099 -1.874038  0.801389
2013-01-03 -1.460016 -2.568240 -3.119444  0.448766
2013-01-04 -2.037679 -2.216273 -4.295830  1.566502
2013-01-05 -1.588421 -1.072934 -4.159571 -0.732816
2013-01-06 -0.864214 -0.780820 -5.286027 -1.671656

In [37]:
df.apply(lambda x: x.max()-x.min())  #lambda함수

A    2.070234
B    3.034479
C    1.381665
D    3.417054
dtype: float64

In [38]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [39]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [40]:
result=pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [42]:
result=pd.concat([df1, df2, df3], keys=['x', 'y', 'z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [43]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [45]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [46]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [47]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

result = pd.concat([df1, df4], axis=1)